Rokasbarasa1/STM32-Quadcopter/src/main.c
// For calibrating the magnetometer I
// used a method found in MicWro Engr Video:
// https://www.youtube.com/watch?v=MinV5V1ioWg
// Mag field norm at my location is 50.503
// use software called Magneto 1.2
// motor 2807

// Magnetometer
float magnetometer_hard_iron_correction[3] = {
    3274.370177,3280.305541,3275.211456
};

float magnetometer_soft_iron_correction[3][3] = {
    {1.021759,0.011752,0.066446},
    {0.011752,1.121668,-0.066759},
    {0.066446,-0.066759,1.172338}
};

// Accelerometer
float accelerometer_correction[3] = {
    0.048688, -0.011751, 1.118072
};

float accelerometer_scale_factor_correction[3][3] = {
    {0.989138,-0.0125890,0.004309},
    {-0.012589,0.997708,-0.001005},
    {0.004309,-0.001005,0.972671}
};

// Gyro
float gyro_correction[3] = {
    -2.532809, 2.282250, 0.640916
};

float base_accelerometer_roll_offset = -1.74464;
float base_accelerometer_pitch_offset = 3.11469;

float accelerometer_roll_offset = 0;
float accelerometer_pitch_offset = 0;

float yaw_offset = 2.77420594;

// ------------------------------------------------------------------------------------------------------ Accelerometer values to degrees conversion
float accelerometer_roll = 0;
float accelerometer_pitch = 0;
float magnetometer_yaw = 0;

// ------------------------------------------------------------------------------------------------------ Radio config
uint8_t tx_address[5] = {0xEE, 0xDD, 0xCC, 0xBB, 0xAA};
char rx_data[32];
char rx_type[32];

// ------------------------------------------------------------------------------------------------------ PID stuff
struct pid acro_roll_pid;
struct pid acro_pitch_pid;
struct pid acro_yaw_pid;

struct pid angle_pitch_pid;
struct pid angle_roll_pid;

struct pid vertical_velocity_pid;

struct pid gps_longitude_pid;
struct pid gps_latitude_pid;

float error_acro_roll = 0;
float error_acro_pitch = 0;
float error_acro_yaw = 0;

float error_angle_pitch = 0;
float error_angle_roll = 0;

float error_throttle = 0;
float error_vertical_velocity = 0;

float error_latitude = 0;
float error_longitude = 0;
float last_error_roll = 0;
float last_error_pitch = 0;


// Notes for PID
// 1) It is important that the natural state without power of the drone is not stable, otherwise 
// some offset of center off mass or pid desired point needs to introduced
// 2) Remember that the drone when in the air has motors spinning at idle power, just enough 
// to float in the air. If you are testing with drone constrained add a base motor speed to account for this.


// Actual PID adjustment for pitch
#define BASE_ANGLE_roll_pitch_MASTER_GAIN 0.4
#define BASE_ANGLE_roll_pitch_GAIN_P 0.0 // 0.35
#define BASE_ANGLE_roll_pitch_GAIN_I 0.0 // 0.0
#define BASE_ANGLE_roll_pitch_GAIN_D 0.0 // 130.0

#define BASE_ACRO_roll_pitch_MASTER_GAIN 0.4
#define BASE_ACRO_roll_pitch_GAIN_P 0.0 // 0.35
#define BASE_ACRO_roll_pitch_GAIN_I 0.0 // 0.0
#define BASE_ACRO_roll_pitch_GAIN_D 0.0 // 130.0

// Used for smooth changes to PID while using remote control. Do not touch this
float angle_roll_pitch_master_gain = BASE_ANGLE_roll_pitch_MASTER_GAIN;
float angle_roll_pitch_gain_p = BASE_ANGLE_roll_pitch_GAIN_P;
float angle_roll_pitch_gain_i = BASE_ANGLE_roll_pitch_GAIN_I;
float angle_roll_pitch_gain_d = BASE_ANGLE_roll_pitch_GAIN_D;

float added_angle_roll_pitch_master_gain = 0;
float added_angle_roll_pitch_gain_p = 0;
float added_angle_roll_pitch_gain_i = 0;
float added_angle_roll_pitch_gain_d = 0;

float acro_roll_pitch_master_gain = BASE_ACRO_roll_pitch_MASTER_GAIN;
float acro_roll_pitch_gain_p = BASE_ACRO_roll_pitch_GAIN_P;
float acro_roll_pitch_gain_i = BASE_ACRO_roll_pitch_GAIN_I;
float acro_roll_pitch_gain_d = BASE_ACRO_roll_pitch_GAIN_D;

float added_acro_roll_pitch_master_gain = 0;
float added_acro_roll_pitch_gain_p = 0;
float added_acro_roll_pitch_gain_i = 0;
float added_acro_roll_pitch_gain_d = 0;

// PID for acro yaw
const float acro_yaw_gain_p = 0.45; 
const float acro_yaw_gain_i = 0.3;

// PID for altitude control
const float vertical_velocity_gain_p = 1.2; 
const float vertical_velocity_gain_i = 3.50;
const float vertical_velocity_gain_d = 0.1;

// PID for gps hold
const float gps_hold_gain_p = 700000.0; 
const float gps_hold_gain_i = 0.0;
const float gps_hold_gain_d = 21000.0;

float acro_target_roll = 0.0;
float acro_target_pitch = 0.0;
float acro_target_yaw = 0.0;

float angle_target_pitch = 0.0;
float angle_target_roll = 0.0;

float target_vertical_velocity = 0.0;

float target_altitude = 0.0;
float target_longitude = 0.0;
float target_latitude = 0.0;

// ------------------------------------------------------------------------------------------------------ Some configurations relating to PID
const float gps_pid_angle_of_attack_max = 5.0;

float acro_mode_rate_degrees_per_second = 300;

// ------------------------------------------------------------------------------------------------------ Sensor other data
float acceleration_data[] = {0,0,0};
float gyro_angular[] = {0,0,0};
float imu_orientation[] = {0,0,0};
float magnetometer_data[] = {0,0,0};
float gps_longitude = 0.0;
float old_gps_longitude = 0.0;
float gps_latitude = 0.0;
float old_gps_latitude = 0.0;
float delta_gps_latitude = 0.0;
float delta_gps_longitude = 0.0;
float in_between_gps_latitude = 0.0;
float in_between_gps_longitude = 0.0;
uint8_t in_between_gps_loop_divider = 50;
uint8_t in_between_gps_loop_divider_counter = 0;
uint8_t gps_fix_type = 0.0;
uint8_t got_gps = 0;

float pressure = 0.0;
float temperature = 0.0;
float altitude = 0.0;
float vertical_velocity = 0.0;

float motor_power[] = {0.0, 0.0, 0.0, 0.0};

uint8_t gps_position_hold_enabled = 0;
uint8_t gps_target_set = 0;

uint8_t use_gps_reset_count = 0;
uint8_t use_gps_reset_count_to_deactivate = 10; // This is done because sometimes some noise sends a neutural pitch and roll

float gps_hold_roll_adjustment_integral = 0.0;
float gps_hold_pitch_adjustment_integral = 0.0;

float roll_effect_on_lat = 0;
float pitch_effect_on_lat = 0;

float roll_effect_on_lon = 0;
float pitch_effect_on_lon = 0;

// ------------------------------------------------------------------------------------------------------ Sensor fusion and filtering stuff
float complementary_ratio = 1.0 - 1.0/(1.0+(1.0/REFRESH_RATE_HZ)); // Depends on how often the loop runs. 1 second / (1 second + one loop time)
float complementary_beta = 0.0;

float filtering_alpha_magnetometer = 0.85; // 200Hz sample rate and 0.85 alpha gives 180Hz cutoff and around 1ms delay
float filtering_alpha_accelerometer = 0.386; // 200Hz sample rate and 0.386 alpha gives 20Hz cutoff and around 1ms delay

struct low_pass_filter filter_magnetometer_x;
struct low_pass_filter filter_magnetometer_y;
struct low_pass_filter filter_magnetometer_z;

struct low_pass_filter filter_accelerometer_x;
struct low_pass_filter filter_accelerometer_y;
struct low_pass_filter filter_accelerometer_z;

struct kalman_filter altitude_and_velocity_kalman;
// ------------------------------------------------------------------------------------------------------ Remote control settings
float max_yaw_attack = 40.0;
float max_roll_attack = 10;
float max_pitch_attack = 10;
float roll_attack_step = 0.2;
float pitch_attack_step = 0.2;
float max_throttle_vertical_velocity = 30; // cm/second

float throttle = 0.0;
float yaw = 50.0;
float last_yaw = 50.0;
float pitch = 50.0;
float roll = 50.0;

float minimum_signal_timing_seconds = 0.2; // Seconds
uint32_t last_signal_timestamp = 0;

// ------------------------------------------------------------------------------------------------------ Logging to SD card
char log_file_base_name[] = "Quadcopter.txt";
char log_file_blackbox_base_name[] = "Quadcopter.BBL";
char *new_log_file_blackbox_base_name;
uint16_t file_index = 0;

uint8_t sd_card_initialized = 0;
uint8_t log_loop_count = 0;
uint8_t sd_card_async = 0;
const uint8_t use_simple_async = 0; // 0 is the complex async
const uint8_t use_blackbox_logging = 1; 

