Rokasbarasa1/STM32-Quadcopter/src/main.c
    // GPS STUFF
    float latitude_sign = 1;
    if(bn357_get_latitude_direction() == 'N') latitude_sign = 1;
    else if(bn357_get_latitude_direction() == 'S') latitude_sign = -1;

    float longitude_sign = 1;
    if(bn357_get_longitude_direction() == 'E') longitude_sign = 1;
    else if(bn357_get_longitude_direction() == 'W') longitude_sign = -1;

    pitch_effect_on_lat = triangle_cos(imu_orientation[2] * (M_PI / 180.0)) * latitude_sign; // + GOOD, - GOOD  // If moving north forward positive, backwards negative
    roll_effect_on_lat = -triangle_cos(imu_orientation[2] * (M_PI / 180.0)) * latitude_sign; // + GOOD, - GOOD  // If moving north roll right positive, roll left south negative
    pitch_effect_on_lon = triangle_cos(imu_orientation[2] * (M_PI / 180.0)) * longitude_sign; // + GOOD, - GOOD 
    roll_effect_on_lon = triangle_cos(imu_orientation[2] * (M_PI / 180.0)) * longitude_sign; // GOOD, - GOOD

    // printf("PLAT: %.2f RLAT: %.2f PLON: %.2f RLON: %.2f\n", 
    //     pitch_effect_on_lat,
    //     roll_effect_on_lat,
    //     pitch_effect_on_lon,
    //     roll_effect_on_lon,
    // );

    // Calculate the in between latitude and longitude to help derivative value
    // if(got_gps){
    //     // Calculate the rate of change of gps at it current refresh rate
    //     delta_gps_latitude = gps_latitude - old_gps_latitude;
    //     delta_gps_longitude = gps_longitude - old_gps_longitude;

    //     // Save the current gps values as old
    //     old_gps_latitude = gps_latitude;
    //     old_gps_longitude = gps_longitude;

    //     in_between_gps_latitude = gps_latitude;
    //     in_between_gps_longitude = gps_longitude;
    //     in_between_gps_loop_divider_counter = 0;
    // }else{
        
    //     // Sometimes the update is skipped on purpose
    //     if(in_between_gps_loop_divider_counter == in_between_gps_loop_divider){
    //         // Update the inbetween
    //         in_between_gps_latitude += delta_gps_latitude * (1.0f/REFRESH_RATE_HZ) * 10;
    //         in_between_gps_longitude += delta_gps_longitude * (1.0f/REFRESH_RATE_HZ) * 10; // Temp times 10 to signify the 10 hz refresh rate of gps

    //         in_between_gps_loop_divider_counter = 0;
    //     }else{
    //         in_between_gps_loop_divider_counter++;
    //     }

    //     // Apply the inbetween 
    //     gps_latitude = in_between_gps_latitude;
    //     gps_longitude = in_between_gps_longitude;
    // }


    // ------------------------------------------------------------------------------------------------------ Use sensor fused data for more data
    float vertical_acceleration[1] = {mpu6050_calculate_vertical_acceleration_cm_per_second(acceleration_data, imu_orientation)};
    float vertical_altitude[1] = {altitude};


    kalman_filter_predict(&altitude_and_velocity_kalman, vertical_acceleration);
    kalman_filter_update(&altitude_and_velocity_kalman, vertical_altitude);

    altitude = kalman_filter_get_state(&altitude_and_velocity_kalman)[0][0];
    vertical_velocity = kalman_filter_get_state(&altitude_and_velocity_kalman)[1][0];

    // printf("Alt %f vel %f ", altitude, vertical_velocity);
    // printf("IMU %f %f %f\n", imu_orientation[0], imu_orientation[1], imu_orientation[2]);
}


void handle_pid_and_motor_control(){
    // float error_altitude = mapValue(pid_get_error(&altitude_pid, altitude, HAL_GetTick()), -180.0, 180.0, -100.0, 100.0);
    // printf("Altitude error %6.2f ", error_altitude);
    
    // For the robot to do work it needs to be receiving radio signals and at the correct angles, facing up
    if(
        imu_orientation[0] <  30 && 
        imu_orientation[0] > -30 && 
        imu_orientation[1] <  30 && 
        imu_orientation[1] > -30 && 
        ((float)HAL_GetTick() - (float)last_signal_timestamp) / 1000.0 <= minimum_signal_timing_seconds
    ){
        // ---------------------------------------------------------------------------------------------- GPS position hold
        float gps_hold_roll_adjustment = 0.0f;
        float gps_hold_pitch_adjustment = 0.0f;
        if(use_gps_hold){
            if(gps_position_hold_enabled && got_gps){
                pid_set_desired_value(&gps_latitude_pid, target_latitude);
                pid_set_desired_value(&gps_longitude_pid, target_longitude);

                error_latitude = pid_get_error(&gps_latitude_pid, gps_latitude, HAL_GetTick());
                error_longitude = pid_get_error(&gps_longitude_pid, gps_longitude, HAL_GetTick());


                float gps_hold_roll_adjustment_calculation = roll_effect_on_lat * error_latitude + roll_effect_on_lon * error_longitude;
                float gps_hold_pitch_adjustment_calculation = pitch_effect_on_lat * error_latitude + pitch_effect_on_lon * error_longitude;


                // if(gps_hold_roll_adjustment_calculation > gps_pid_angle_of_attack_max){
                //     gps_hold_roll_adjustment_calculation = gps_pid_angle_of_attack_max;
                // }else if(gps_hold_roll_adjustment_calculation < -gps_pid_angle_of_attack_max){
                //     gps_hold_roll_adjustment_calculation = -gps_pid_angle_of_attack_max;
                // } 
            
                // if(gps_hold_pitch_adjustment_calculation > gps_pid_angle_of_attack_max){
                //     gps_hold_pitch_adjustment_calculation = gps_pid_angle_of_attack_max;
                // }else if(gps_hold_pitch_adjustment_calculation < -gps_pid_angle_of_attack_max){
                //     gps_hold_pitch_adjustment_calculation = -gps_pid_angle_of_attack_max;
                // }
                
                // gps_hold_roll_adjustment = gps_hold_roll_adjustment_integral + map_value(
                //     gps_hold_roll_adjustment_calculation, 
                //     -gps_pid_angle_of_attack_max, 
                //     gps_pid_angle_of_attack_max, 
                //     -pitch_attack_step, 
                //     pitch_attack_step
                // );

                // gps_hold_pitch_adjustment = gps_hold_pitch_adjustment_calculation + map_value(
                //     gps_hold_pitch_adjustment_calculation, 
                //     -gps_pid_angle_of_attack_max, 
                //     gps_pid_angle_of_attack_max, 
                //     -pitch_attack_step, 
                //     pitch_attack_step
                // );

