Rokasbarasa1/STM32-Quadcopter/src/main.c
                // if(gps_hold_roll_adjustment > gps_pid_angle_of_attack_max){
                //     gps_hold_roll_adjustment = gps_pid_angle_of_attack_max;
                // }else if(gps_hold_roll_adjustment < -gps_pid_angle_of_attack_max){
                //     gps_hold_roll_adjustment = -gps_pid_angle_of_attack_max;
                // }
                
                // if(gps_hold_pitch_adjustment > gps_pid_angle_of_attack_max){
                //     gps_hold_pitch_adjustment = gps_pid_angle_of_attack_max;
                // }else if(gps_hold_pitch_adjustment < -gps_pid_angle_of_attack_max){
                //     gps_hold_pitch_adjustment = -gps_pid_angle_of_attack_max;
                // }



                if(gps_hold_roll_adjustment_calculation > gps_pid_angle_of_attack_max){
                    gps_hold_roll_adjustment_calculation = gps_pid_angle_of_attack_max;
                }else if(gps_hold_roll_adjustment_calculation < -gps_pid_angle_of_attack_max){
                    gps_hold_roll_adjustment_calculation = -gps_pid_angle_of_attack_max;
                } 
            
                if(gps_hold_pitch_adjustment_calculation > gps_pid_angle_of_attack_max){
                    gps_hold_pitch_adjustment_calculation = gps_pid_angle_of_attack_max;
                }else if(gps_hold_pitch_adjustment_calculation < -gps_pid_angle_of_attack_max){
                    gps_hold_pitch_adjustment_calculation = -gps_pid_angle_of_attack_max;
                }

                gps_hold_roll_adjustment = gps_hold_roll_adjustment_calculation;
                gps_hold_pitch_adjustment = gps_hold_pitch_adjustment_calculation;
                
                // printf("%f;%f;%f;%f;%.2f;%.2f;%.2f;%.2f;%.2f;", target_latitude, target_longitude, gps_latitude, gps_longitude, gps_hold_roll_adjustment, gps_hold_pitch_adjustment, imu_orientation[0], imu_orientation[1], imu_orientation[2]);
                // printf("%.2f;%.2f;%.2f;%.2f;", roll_effect_on_lat, roll_effect_on_lon, pitch_effect_on_lat, pitch_effect_on_lon);
                // printf("\n");

                last_error_roll = gps_hold_roll_adjustment;
                last_error_pitch = gps_hold_pitch_adjustment;

                // printf("off: %3.1f %3.1f\n", gps_hold_roll_adjustment, gps_hold_pitch_adjustment);
            }else if(gps_position_hold_enabled && got_gps == 0){
                // Put in the same values'
                gps_hold_roll_adjustment = last_error_roll;
                gps_hold_pitch_adjustment = last_error_pitch;
            }
        }

        // ---------------------------------------------------------------------------------------------- Altitude hold
        if(use_vertical_velocity_control){
            pid_set_desired_value(&vertical_velocity_pid, target_vertical_velocity);
            error_vertical_velocity = pid_get_error(&vertical_velocity_pid, vertical_velocity, HAL_GetTick());
        }else{
            error_vertical_velocity = 0;
        }

        // ---------------------------------------------------------------------------------------------- Angle mode
        if(use_angle_mode){
            pid_set_desired_value(&angle_roll_pid, angle_target_roll + gps_hold_roll_adjustment);
            pid_set_desired_value(&angle_pitch_pid, angle_target_pitch + gps_hold_pitch_adjustment);

            // For now not logging desired angle mode

            error_angle_roll = pid_get_error(&angle_roll_pid, imu_orientation[0], HAL_GetTick());
            error_angle_pitch = pid_get_error(&angle_pitch_pid, imu_orientation[1], HAL_GetTick());

        }else{
            error_angle_roll = 0;
            error_angle_pitch = 0;
        }

        // ---------------------------------------------------------------------------------------------- Acro mode
        if(use_angle_mode){
            pid_set_desired_value(&acro_roll_pid, error_angle_roll);
            pid_set_desired_value(&acro_pitch_pid, error_angle_pitch);
            pid_set_desired_value(&acro_yaw_pid, acro_target_yaw);
            
            PID_set_points[0] = error_angle_roll; // Logging
            PID_set_points[1] = error_angle_pitch; // Logging
            PID_set_points[2] = acro_target_yaw; // Logging
        }else{
            pid_set_desired_value(&acro_roll_pid, acro_target_roll);
            pid_set_desired_value(&acro_pitch_pid, acro_target_pitch);
            pid_set_desired_value(&acro_yaw_pid, acro_target_yaw);
            
            PID_set_points[0] = acro_target_roll; // Logging
            PID_set_points[1] = acro_target_pitch; // Logging
            PID_set_points[2] = acro_target_yaw; // Logging
        }


        error_acro_roll = pid_get_error(&acro_roll_pid, gyro_angular[0], HAL_GetTick());

        PID_proportional[1] = pid_get_last_proportional_error(&acro_roll_pid); // Logging
        PID_integral[1] = pid_get_last_integral_error(&acro_roll_pid); // Logging
        PID_derivative[1] = pid_get_last_derivative_error(&acro_roll_pid); // Logging


        error_acro_pitch = pid_get_error(&acro_pitch_pid, gyro_angular[1], HAL_GetTick());
        PID_proportional[0] = pid_get_last_proportional_error(&acro_pitch_pid); // Logging
        PID_integral[0] = pid_get_last_integral_error(&acro_pitch_pid); // Logging
        PID_derivative[0] = pid_get_last_derivative_error(&acro_pitch_pid); // Logging


        error_acro_yaw = pid_get_error(&acro_yaw_pid, gyro_angular[2], HAL_GetTick());

        PID_proportional[2] = pid_get_last_proportional_error(&acro_yaw_pid); // Logging
        PID_integral[2] = pid_get_last_integral_error(&acro_yaw_pid); // Logging


        // ---------------------------------------------------------------------------------------------- Throttle
        error_throttle = throttle*0.9;

        // ---------------------------------------------------------------------------------------------- Applying to throttle to escs
        motor_power[0] = ( error_acro_roll) + ( error_acro_pitch) + ( error_acro_yaw);
        motor_power[1] = (-error_acro_roll) + ( error_acro_pitch) + (-error_acro_yaw);
        motor_power[2] = (-error_acro_roll) + (-error_acro_pitch) + ( error_acro_yaw);
        motor_power[3] = ( error_acro_roll) + (-error_acro_pitch) + (-error_acro_yaw);

        // For throttle control logic
        motor_power[0] += error_throttle * (~use_vertical_velocity_control & 1) + error_vertical_velocity * use_vertical_velocity_control;
        motor_power[1] += error_throttle * (~use_vertical_velocity_control & 1) + error_vertical_velocity * use_vertical_velocity_control;
        motor_power[2] += error_throttle * (~use_vertical_velocity_control & 1) + error_vertical_velocity * use_vertical_velocity_control;
        motor_power[3] += error_throttle * (~use_vertical_velocity_control & 1) + error_vertical_velocity * use_vertical_velocity_control;

        // 2212
        // Motor B (0) 14460 rpm BL but should be BL
        // Motor C (1) 14160 rpm FL but should be BR
        // Motor D (2) 14460 rpm BR but should be FR
        // Motor A (3) 13740 rpm FR but should be FL

        // FPV cam side FRONT
        // Front-right
        TIM2->CCR1 = setServoActivationPercent(motor_power[2], esc_lowest_motor_spin, actual_max_esc_pwm_value);
        // Front-left
        TIM2->CCR2 = setServoActivationPercent(motor_power[3], esc_lowest_motor_spin, actual_max_esc_pwm_value);
        
        // GPS side BACK
        // Back-left
        TIM1->CCR1 = setServoActivationPercent(motor_power[0], esc_lowest_motor_spin, actual_max_esc_pwm_value);
        // Back-right
        TIM1->CCR4 = setServoActivationPercent(motor_power[1], esc_lowest_motor_spin, actual_max_esc_pwm_value);

        // For logging
        // BL <- BL
        motor_power[0] = setServoActivationPercent(motor_power[0], esc_lowest_motor_spin, actual_max_esc_pwm_value); // Logging
        // FL <- FL
        motor_power[1] = setServoActivationPercent(motor_power[3], esc_lowest_motor_spin, actual_max_esc_pwm_value); // Logging
        // BR <- BR
        motor_power[2] = setServoActivationPercent(motor_power[1], esc_lowest_motor_spin, actual_max_esc_pwm_value); // Logging
        // FR <- FR
        motor_power[3] = setServoActivationPercent(motor_power[2], esc_lowest_motor_spin, actual_max_esc_pwm_value); // Logging
    }else{
        // GPS side
        TIM2->CCR1 = setServoActivationPercent(0, min_esc_pwm_value, actual_max_esc_pwm_value);
        TIM2->CCR2 = setServoActivationPercent(0, min_esc_pwm_value, actual_max_esc_pwm_value);

        // No gps side
        TIM1->CCR1 = setServoActivationPercent(0, min_esc_pwm_value, actual_max_esc_pwm_value);
        TIM1->CCR4 = setServoActivationPercent(0, min_esc_pwm_value, actual_max_esc_pwm_value);
        
